Repository: WilliamAGENEAU/cycles
Catalog: lib/l10n/app_*.arb
Languages: fr

# appTitle
source: Menstrudel
fr: Cycles

source: Ongoing
fr: En cours

source: Time
fr: Heure

source: Start
fr: Début

source: End
fr: Fin

source: Day
fr: Jour

source: Days
fr: Jours

# dayCount
source: {count, plural, one{{count} Day} other{{count} Days}}
fr: {count, plural, one{{count} jour} other{{count} jours}}

source: Delete
fr: Supprimer

source: Clear
fr: Effacer

source: Save
fr: Enregistrer

source: Confirm
fr: Confirmer

source: Set
fr: Définir

source: Yes
fr: Oui

source: No
fr: Non

source: Cancel
fr: Annuler

source: Select
fr: Sélectionner

source: Close
fr: Fermer

source: Flow
fr: Flux

# navBar_insights
source: Insights
fr: Analyses

# navBar_logs
source: Logs
fr: Journaux

# navBar_pill
source: Pill
fr: Pilule

# navBar_settings
source: Settings
fr: Paramètres

# flowIntensity_none
source: None
fr: Aucun

# flowIntensity_spotting
source: Spotting
fr: Légères pertes

# flowIntensity_light
source: Light
fr: Léger

# flowIntensity_moderate
source: Moderate
fr: Modéré

# flowIntensity_heavy
source: Heavy
fr: Abondant

# symptom_headache
source: Headache
fr: Maux de tête

# symptom_cramps
source: Cramps
fr: Crampes

# symptom_nausea
source: Nausea
fr: Nausées

# symptom_moodSwings
source: Mood Swings
fr: Sautes d’humeur

# symptom_bloating
source: Bloating
fr: Ballonnements

# symptom_acne
source: Acne
fr: Acné

# painLevel_title
source: Pain Level
fr: Niveau de douleur

# painLevel_none
source: None
fr: Aucune

# painLevel_mild
source: Mild
fr: Légère

# painLevel_moderate
source: Moderate
fr: Modérée

# painLevel_severe
source: Severe
fr: Sévère

# pain_unbearable
source: Unbearable
fr: Insupportable

# notification_periodTitle
source: Period Approaching
fr: Règles imminentes

# notification_periodOverdueTitle
source: Period Overdue
fr: Règles en retard

# notification_periodOverdueBody
source: {count, plural, =1{Your next period is overdue by 1 day.} other{Your next period is overdue by {count} days.}}
fr: {count, plural, =1{Vos règles ont 1 jour de retard.} other{Vos règles ont {count} jours de retard.}}

# notification_pillTitle
source: Pill Reminder
fr: Rappel pilule

# notification_pillBody
source: Don't forget to take your pill for today.
fr: N’oubliez pas de prendre votre pilule aujourd’hui.

# notification_tamponReminderTitle
source: Tampon Reminder
fr: Rappel tampon

# notification_tamponReminderBody
source: Remember to change your tampon.
fr: Pensez à changer votre tampon.

# mainScreen_insightsPageTitle
source: Your Insights
fr: Vos analyses

# mainScreen_pillsPageTitle
source: Pills
fr: Pilules

# mainScreen_settingsPageTitle
source: Settings
fr: Paramètres

# mainScreen_tooltipSetReminder
source: Tampon reminder
fr: Rappel tampon

# mainScreen_tooltipCancelReminder
source: Cancel reminder
fr: Annuler le rappel

# mainScreen_tooltipLogPeriod
source: Log period
fr: Enregistrer une période

# insightsScreen_errorPrefix
source: Error:
fr: Erreur :

# insightsScreen_noDataAvailable
source: No data available.
fr: Aucune donnée disponible.

# logsScreen_calculatingPrediction
source: Calculating prediction...
fr: Calcul de la prédiction...

# logScreen_logAtLeastTwoPeriods
source: Log at least two periods to estimate next cycle.
fr: Enregistrez au moins deux périodes pour estimer le prochain cycle.

# logScreen_nextPeriodEstimate
source: Next period Est
fr: Prochaines règles estimées

# logScreen_periodDueToday
source: Period due today
fr: Règles prévues aujourd’hui

# logScreen_periodOverdueBy
source: {count, plural, =1{Period overdue by 1 day} other{Period overdue by {count} days}}
fr: {count, plural, =1{Règles en retard d’1 jour} other{Règles en retard de {count} jours}}

# logScreen_tamponReminderSetFor
source: Tampon reminder set for
fr: Rappel tampon défini pour

# logScreen_tamponReminderCancelled
source: Tampon reminder cancelled.
fr: Rappel tampon annulé.

# logScreen_couldNotCancelReminder
source: Could not cancel reminder
fr: Impossible d’annuler le rappel.

# pillScreen_pillForTodayMarkedAsTaken
source: Pill for today marked as taken.
fr: Pilule du jour marquée comme prise.

# pillScreen_pillForTodayMarkedAsSkipped
source: Pill for today marked as skipped.
fr: Pilule du jour marquée comme oubliée.

# settingsScreen_selectHistoryView
source: Select History View
fr: Choisir la vue de l’historique

# settingsScreen_deleteRegimen_question
source: Delete Regimen?
fr: Supprimer le traitement ?

# settingsScreen_deleteRegimenDescription
source: This will delete your current pill pack settings and all associated pill logs. This cannot be undone.
fr: Cela supprimera votre configuration de pilule actuelle et tous les journaux associés. Cette action est irréversible.

# settingsScreen_allLogsHaveBeenCleared
source: All logs have been cleared.
fr: Tous les journaux ont été effacés.

# settingsScreen_clearAllLogs_question
source: Clear All Logs?
fr: Effacer tous les journaux ?

# settingsScreen_deleteAllLogsDescription
source: This will permanently delete all your period logs. Your app settings will not be affected.
fr: Cela supprimera définitivement tous vos enregistrements de périodes. Les paramètres de l’application ne seront pas affectés.

# settingsScreen_appearance
source: Appearance
fr: Apparence

# settingsScreen_historyViewStyle
source: History View Style
fr: Style d’historique

# settingsScreen_appTheme
source: App Theme
fr: Thème de l’application

# settingsScreen_themeLight
source: Light
fr: Clair

# settingsScreen_themeDark
source: Dark
fr: Sombre

# settingsScreen_themeSystem
source: System
fr: Système

# settingsScreen_dynamicTheme
source: Dynamic Theme
fr: Thème dynamique

# settingsScreen_useWallpaperColors
source: Use Wallpaper Colors
fr: Utiliser les couleurs du fond d’écran

# settingsScreen_themeColor
source: Theme Color
fr: Couleur du thème

# settingsScreen_pickAColor
source: Pick a Color
fr: Choisir une couleur

# settingsScreen_view
source: View
fr: Vue

# settingsScreen_birthControl
source: Birth Control
fr: Contraception

# settingsScreen_setUpPillRegimen
source: Set Up Pill Regimen
fr: Configurer le traitement

# settingsScreen_trackYourDailyPillIntake
source: Track Your Daily Pill Intake
fr: Suivre la prise quotidienne de la pilule

# settingsScreen_dailyPillReminder
source: Daily Pill Reminder
fr: Rappel quotidien de pilule

# settingsScreen_reminderTime
source: Reminder Time
fr: Heure du rappel

# settingsScreen_periodPredictionAndReminders
source: Period Prediction & Reminders
fr: Prédictions et rappels de règles

# settingsScreen_upcomingPeriodReminder
source: Upcoming Period Reminder
fr: Rappel de règles à venir

# settingsScreen_remindMeBefore
source: Remind Me Before
fr: Me rappeler avant

# settingsScreen_notificationTime
source: Notification Time
fr: Heure de notification

# settingsScreen_overduePeriodReminder
source: Overdue Period Reminder
fr: Rappel de règles en retard

# settingsScreen_remindMeAfter
source: Remind Me After
fr: Me rappeler après

# settingsScreen_dataManagement
source: Data Management
fr: Gestion des données

# settingsScreen_clearAllLogs
source: Clear All Logs
fr: Effacer tous les journaux

# settingsScreen_clearAllPillData
source: Clear All Pill Data
fr: Effacer toutes les données de pilule

# settingsScreen_clearAllPillData_question
source: Clear All Pill Data?
fr: Effacer toutes les données de pilule ?

# settingsScreen_deleteAllPillDataDescription
source: This will permanently delete your pill regimen, reminders, and intake history. This action cannot be undone.
fr: Cela supprimera définitivement votre traitement, vos rappels et votre historique. Cette action est irréversible.

# settingsScreen_allPillDataCleared
source: All pill data has been cleared.
fr: Toutes les données de pilule ont été effacées.

# settingsScreen_dangerZone
source: Danger Zone
fr: Zone à risque

# settingsScreen_clearAllLogsSubtitle
source: Deletes your entire period and symptom history.
fr: Supprime tout votre historique de règles et de symptômes.

# settingsScreen_clearAllPillDataSubtitle
source: Removes your pill regimen and intake history.
fr: Supprime votre traitement et l’historique des prises.

# settingsScreen_security
source: Security
fr: Sécurité

# securityScreen_enableBiometricLock
source: Enable Biometric Lock
fr: Activer le verrouillage biométrique

# securityScreen_enableBiometricLockSubtitle
source: Require fingerprint or face ID to open the app.
fr: Exiger une empreinte digitale ou la reconnaissance faciale pour ouvrir l’application.

# securityScreen_noBiometricsAvailable
source: No passcode, fingerprint, or face ID found. Please set one up in your device's settings.
fr: Aucun code, empreinte ou reconnaissance faciale détecté. Veuillez en configurer un dans les paramètres de votre appareil.

# settingsScreen_preferences
source: Preferences
fr: Préférences

# preferencesScreen_tamponReminderButton
source: Always Show Reminder Button
fr: Afficher toujours le bouton de rappel

# preferencesScreen_tamponReminderButtonSubtitle
source: Makes the tampon reminder button permanently visible on the main screen.
fr: Affiche en permanence le bouton de rappel tampon sur l’écran principal.

# settingsScreen_about
source: About
fr: À propos

# aboutScreen_githubSubtitle
source: Source code and issue tracking
fr: Code source et suivi des problèmes

# aboutScreen_share
source: Share
fr: Partager

# aboutScreen_shareSubtitle
source: Share the app with friends
fr: Partager l’application avec des amis

# aboutScreen_urlError
source: Could not open the link.
fr: Impossible d’ouvrir le lien.

# tamponReminderDialog_tamponReminderTitle
source: Tampon Reminder
fr: Rappel tampon

# tamponReminderDialog_tamponReminderMaxDuration
source: Max duration is 8 hours.
fr: Durée maximale : 8 heures.

# reminderCountdownDialog_title
source: Reminder Due In
fr: Rappel dans

# reminderCountdownDialog_dueAt
source: Due at {time}
fr: Prévu à {time}

# cycleLengthVarianceWidget_LogAtLeastTwoPeriods
source: Need at least two cycles to show variance.
fr: Au moins deux cycles sont nécessaires pour afficher la variance.

# cycleLengthVarianceWidget_cycleAndPeriodVeriance
source: Cycle & Period Variance
fr: Variance du cycle et de la période

# cycleLengthVarianceWidget_averageCycle
source: Average Cycle
fr: Cycle moyen

# cycleLengthVarianceWidget_averagePeriod
source: Average Period
fr: Période moyenne

# cycleLengthVarianceWidget_period
source: Period
fr: Période

# flowIntensityWidget_flowIntensityBreakdown
source: Flow Intensity Breakdown
fr: Répartition de l’intensité du flux

# flowIntensityWidget_noFlowDataLoggedYet
source: No flow data logged yet.
fr: Aucune donnée de flux enregistrée pour le moment.

# painLevelWidget_noPainDataLoggedYet
source: No pain data logged yet.
fr: Aucune donnée de douleur enregistrée pour le moment.

# painLevelWidget_painLevelBreakdown
source: Pain Level Breakdown
fr: Répartition des niveaux de douleur

# monthlyFlowChartWidget_noDataToDisplay
source: No data to display.
fr: Aucune donnée à afficher.

# monthlyFlowChartWidget_cycleFlowPatterns
source: Cycle Flow Patterns
fr: Schémas de flux menstruel

# monthlyFlowChartWidget_cycleFlowPatternsDescription
source: Each line represents one complete cycle
fr: Chaque ligne représente un cycle complet

# symptomFrequencyWidget_noSymptomsLoggedYet
source: No symptoms logged yet.
fr: Aucun symptôme enregistré pour le moment.

# symptomFrequencyWidget_mostCommonSymptoms
source: Most Common Symptoms
fr: Symptômes les plus fréquents

# yearHeatMapWidget_yearlyOverview
source: Yearly Overview
fr: Vue d’ensemble annuelle

# journalViewWidget_logYourFirstPeriod
source: Log your first period.
fr: Enregistrez votre première période.

# listViewWidget_noPeriodsLogged
source: No periods logged yet. Tap the + button to add one.
fr: Aucune période enregistrée. Appuyez sur le bouton + pour en ajouter une.

# listViewWidget_confirmDelete
source: Confirm Delete
fr: Confirmer la suppression

# listViewWidget_confirmDeleteDescription
source: Are you sure you want to delete this entry?
fr: Voulez-vous vraiment supprimer cette entrée ?

# emptyPillStateWidget_noPillRegimenFound
source: No pill regimen found.
fr: Aucun traitement trouvé.

# emptyPillStateWidget_noPillRegimenFoundDescription
source: Set up your pill pack in settings to start tracking.
fr: Configurez votre traitement dans les paramètres pour commencer le suivi.

# pillPackVisualiser_yourPack
source: Your Pack
fr: Votre plaquette

# pillStatus_pillsOfTotal
source: {count, plural, =1{of 1 pill} other{of {count} pills}}
fr: {count, plural, =1{sur 1 pilule} other{sur {count} pilules}}

# pillStatus_undo
source: Undo
fr: Annuler

# pillStatus_skip
source: Skip
fr: Ignorer

# pillStatus_markAsTaken
source: Mark As Taken
fr: Marquer comme prise

# regimenSetupWidget_setUpPillRegimen
source: Set Up Pill Regimen
fr: Configurer le traitement

# regimenSetupWidget_packName
source: Pack Name
fr: Nom de la plaquette

# regimenSetupWidget_pleaseEnterAName
source: Please enter a name
fr: Veuillez saisir un nom

# regimenSetupWidget_activePills
source: Active Pills
fr: Pilules actives

# regimenSetupWidget_enterANumber
source: Enter a number
fr: Saisissez un nombre

# regimenSetupWidget_placeboPills
source: Placebo Pills
fr: Pilules placebo

# regimenSetupWidget_firstDayOfThisPack
source: First Day of This Pack
fr: Premier jour de cette plaquette

# symptomEntrySheet_logYourDay
source: Log Your Day
fr: Enregistrez votre journée

# symptomEntrySheet_symptomsOptional
source: Symptoms (Optional)
fr: Symptômes (optionnel)

# periodDetailsSheet_symptoms
source: Symptoms
fr: Symptômes

# periodDetailsSheet_flow
source: Flow
fr: Flux

# periodPredictionCircle_days
source: {count, plural, =1{Day} other{Days}}
fr: {count, plural, =1{jour} other{jours}}
